In [1]:
import kaggle
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [8]:
# downloading the customer_data
!kaggle datasets download -d captaindatasets/istanbul-mall --file customer_data.xlsx --force

Dataset URL: https://www.kaggle.com/datasets/captaindatasets/istanbul-mall
License(s): other
Downloading customer_data.xlsx to C:\Users\Denis M

  0%|          | 0.00/2.54M [00:00<?, ?B/s]
100%|##########| 2.54M/2.54M [00:00<00:00, 548MB/s]

In [2]:
file_path = r"C:\Users\Denis M\customer_data.xlsx"
df_customers = pd.read_excel(file_path)
print(df_customers.head())

  customer_id  gender   age payment_method
0     C241288  Female  28.0    Credit Card
1     C111565    Male  21.0     Debit Card
2     C266599    Male  20.0           Cash
3     C988172  Female  66.0    Credit Card
4     C189076  Female  53.0           Cash

In [11]:
# downloading the sales_data
!kaggle datasets download -d captaindatasets/istanbul-mall --file sales_data.xlsx --force

Dataset URL: https://www.kaggle.com/datasets/captaindatasets/istanbul-mall
License(s): other
Downloading sales_data.xlsx to C:\Users\Denis M

  0%|          | 0.00/4.54M [00:00<?, ?B/s]
100%|##########| 4.54M/4.54M [00:00<00:00, 605MB/s]

In [3]:
file_path = r"C:\Users\Denis M\sales_data.xlsx"
df_sales = pd.read_excel(file_path)
print(df_sales.head())

  invoice_no customer_id  category  quantity invoice date    price  \
0    I138884     C241288  Clothing         5   05/08/2022  1500.40
1    I317333     C111565     Shoes         3   12/12/2021  1800.51
2    I127801     C266599  Clothing         1   09/11/2021   300.08
3    I173702     C988172     Shoes         5   05/16/2021  3000.85
4    I337046     C189076     Books         4   10/24/2021    60.60

              shopping_mall
0         South Coast Plaza
1            Beverly Center
2    Westfield Century City
3  Stanford Shopping Center
4         South Coast Plaza

In [13]:
# downloading the shopping_mall_data
!kaggle datasets download -d captaindatasets/istanbul-mall --file shopping_mall_data.xlsx --force

Dataset URL: https://www.kaggle.com/datasets/captaindatasets/istanbul-mall
License(s): other
Downloading shopping_mall_data.xlsx to C:\Users\Denis M

  0%|          | 0.00/9.83k [00:00<?, ?B/s]
100%|##########| 9.83k/9.83k [00:00<00:00, 6.82MB/s]

In [4]:
file_path = r"C:\Users\Denis M\shopping_mall_data.xlsx"
df_shopping_mall = pd.read_excel(file_path)
print(df_shopping_mall.head())

            shopping_mall  construction_year  area (sqm)     location  \
0       South Coast Plaza               1967      250000   Costa Mesa
1   Westfield Valley Fair               1986      220000  Santa Clara
2               The Grove               2002       56000  Los Angeles
3  Westfield Century City               1964      133000  Los Angeles
4          Beverly Center               1982      111000  Los Angeles

   store_count
0          270
1          230
2          140
3          200
4          160

In [5]:
# detecting default datatypes of the columns
df_customers.dtypes

customer_id        object
gender             object
age               float64
payment_method     object
dtype: object

In [6]:
# checking for dupicated entries
df_customers.duplicated().sum()

0

In [7]:
# Distinct gender type
df_customers["gender"].value_counts()

gender
Female    59482
Male      39975
Name: count, dtype: int64

In [8]:
# Distinct payment type
df_customers["payment_method"].value_counts()

payment_method
Cash           44447
Credit Card    34931
Debit Card     20079
Name: count, dtype: int64

In [9]:
# Checking for empty or null vales
df_customers.isnull().sum()

customer_id         0
gender              0
age               119
payment_method      0
dtype: int64

In [10]:
df_customers["age"].unique()

array([28., 21., 20., 66., 53., 49., 32., 69., 60., 36., 29., 67., 25.,
       24., 65., 42., 46., 23., 27., 52., 44., 51., 50., 68., 43., 59.,
       54., 48., 40., 41., 19., 18., 22., 61., 45., 64., 33., 63., 34.,
       47., 38., 57., 30., 26., nan, 62., 39., 55., 56., 35., 31., 37.,
       58.])

In [11]:
df_customers[df_customers["age"].isna()]

      customer_id  gender  age payment_method
91        C157070  Female  NaN     Debit Card
92        C177975  Female  NaN     Debit Card
93        C830576  Female  NaN     Debit Card
94        C807389  Female  NaN     Debit Card
95        C277842  Female  NaN     Debit Card
...           ...     ...  ...            ...
97308     C122968    Male  NaN    Credit Card
97309     C290775    Male  NaN           Cash
97310     C574895  Female  NaN           Cash
97311     C437895  Female  NaN           Cash
97312     C525919    Male  NaN     Debit Card

[119 rows x 4 columns]

In [12]:
df_customers["age"].mode()

0    37.0
Name: age, dtype: float64

In [13]:
# replacing null age entries with most repeated age value
df_customers["age"].fillna(df_customers["age"].mode()[0], inplace=True)

In [14]:
# creating new age_group column by categorising the age column based on age
def classify_age(age):
    if 18 <= age <= 29:
        return "Youth"
    elif 30 <= age <= 49:
        return "Middle Age"
    elif 50 <= age <= 59:
        return "Adults"
    elif age>= 60:
        return "Seniors"

df_customers["age_group"] = df_customers["age"].apply(classify_age)

In [15]:
df_customers["age_group"].value_counts()

age_group
Middle Age    38515
Youth         23017
Seniors       19018
Adults        18907
Name: count, dtype: int64

In [16]:
df_customers.head()

  customer_id  gender   age payment_method age_group
0     C241288  Female  28.0    Credit Card     Youth
1     C111565    Male  21.0     Debit Card     Youth
2     C266599    Male  20.0           Cash     Youth
3     C988172  Female  66.0    Credit Card   Seniors
4     C189076  Female  53.0           Cash    Adults

In [17]:
# Checking for empty or null vales
df_sales.isnull().sum()

invoice_no       0
customer_id      0
category         0
quantity         0
invoice date     0
price            0
shopping_mall    0
dtype: int64

In [18]:
df_sales.head()

,invoice_no,customer_id,category,quantity,invoice date,price,shopping_mall
0,I138884,C241288,Clothing,5,05/08/2022,1500.40,South Coast Plaza
1,I317333,C111565,Shoes,3,12/12/2021,1800.51,Beverly Center
2,I127801,C266599,Clothing,1,09/11/2021,300.08,Westfield Century City
3,I173702,C988172,Shoes,5,05/16/2021,3000.85,Stanford Shopping Center
4,I337046,C189076,Books,4,10/24/2021,60.60,South Coast Plaza

In [19]:
# detecting default datatype of columns
df_sales.dtypes

invoice_no        object
customer_id       object
category          object
quantity           int64
invoice date      object
price            float64
shopping_mall     object
dtype: object

In [20]:
# changing invoice date data type and formate
df_sales['invoice date'] = pd.to_datetime(df_sales['invoice date'], errors='coerce').dt.strftime('%Y-%m-%d')

In [21]:
df_sales.dtypes

invoice_no        object
customer_id       object
category          object
quantity           int64
invoice date      object
price            float64
shopping_mall     object
dtype: object

In [22]:
# cross checking for any negative values
df_sales[df_sales["quantity"]<0].sum()
df_sales[df_sales["price"]<0].sum()

invoice_no         0
customer_id        0
category           0
quantity           0
invoice date       0
price            0.0
shopping_mall      0
dtype: object

In [23]:
# Create total_sales Column
df_sales['total_sales'] = df_sales['quantity'] * df_sales['price']

In [24]:
# Step 7: Categorize Sales Volume
def categorize_sales(value):
    if value < 500:
        return "Low"
    elif 500 <= value < 2000:
        return "Medium"
    else:
        return "High"

df_sales['sales_category'] = df_sales['total_sales'].apply(categorize_sales)

In [25]:
df_sales['sales_category'].value_counts()

sales_category
Low       46669
High      32797
Medium    19991
Name: count, dtype: int64

In [26]:
df_sales

,invoice_no,customer_id,category,quantity,invoice date,price,shopping_mall,total_sales,sales_category
0,I138884,C241288,Clothing,5,2022-05-08,1500.40,South Coast Plaza,7502.00,High
1,I317333,C111565,Shoes,3,2021-12-12,1800.51,Beverly Center,5401.53,High
2,I127801,C266599,Clothing,1,2021-09-11,300.08,Westfield Century City,300.08,Low
3,I173702,C988172,Shoes,5,2021-05-16,3000.85,Stanford Shopping Center,15004.25,High
4,I337046,C189076,Books,4,2021-10-24,60.60,South Coast Plaza,242.40,Low
...,...,...,...,...,...,...,...,...,...
99452,I219422,C441542,Souvenir,5,2022-09-21,58.65,South Coast Plaza,293.25,Low
99453,I325143,C569580,Food & Beverage,2,2021-09-22,10.46,Beverly Center,20.92,Low
99454,I824010,C103292,Food & Beverage,2,2021-03-28,10.46,Westfield Century City,20.92,Low
99455,I702964,C800631,Technology,4,2021-03-16,4200.00,Westfield Valley Fair,16800.00,High
99456,I232867,C273973,Souvenir,3,2022-10-15,35.19,Del Amo Fashion Center,105.57,Low

In [27]:
# Checking for empty or null vales
df_shopping_mall.isnull().sum()

shopping_mall        0
construction_year    0
area (sqm)           0
location             0
store_count          0
dtype: int64

In [28]:
# detecting default datatypes of columns
df_shopping_mall.dtypes

shopping_mall        object
construction_year     int64
area (sqm)            int64
location             object
store_count           int64
dtype: object

In [31]:
sales_malls = df_sales['shopping_mall'].unique()
sales_malls

array(['South Coast Plaza', 'Beverly Center', 'Westfield Century City',
       'Stanford Shopping Center', 'Westfield Valley Fair',
       'Del Amo Fashion Center', 'The Grove', 'Irvine Spectrum',
       'Glendale Galleria', 'Fashion Valley'], dtype=object)

In [33]:
mall_names = df_shopping_mall['shopping_mall'].unique()
mall_names

array(['South Coast Plaza', 'Westfield Valley Fair', 'The Grove',
       'Westfield Century City', 'Beverly Center', 'Fashion Valley',
       'Stanford Shopping Center', 'Glendale Galleria',
       'Irvine Spectrum Center', 'Del Amo Fashion Center'], dtype=object)

In [40]:
# checking whether mall names are correct
for sales_mall_name in sales_malls:
    if sales_mall_name not in mall_names:
        print(sales_mall_name)

Irvine Spectrum

In [42]:
# replacing "Irvine Spectrum" to 'Irvine Spectrum Center'
df_sales['shopping_mall'] = df_sales['shopping_mall'].replace("Irvine Spectrum",'Irvine Spectrum Center')

In [44]:
conn_string = 'mysql+mysqlconnector://root:sqlroot@localhost/California_Mall_Customer_db'
db = create_engine(conn_string)
conn = db.connect()

In [45]:
# appending customers data into customers table in the database
df_customers.to_sql("customers", con=conn, if_exists='append', index=False)

99457

In [46]:
# appending sales data into sales table in the database
df_sales.to_sql("sales", con=conn, if_exists='append', index=False)

99457

In [47]:
# appending shopping mall data into shopping_mall table in the database
df_shopping_mall.to_sql("shopping_mall", con=conn, if_exists='append', index=False)

10

In [48]:
conn.close()